Revit 2020 API
AdvancedWood.WoodEarlycolorPerlinEnable Property
 The property labeled "Use perlin noise for earlywood color" from the "PrismWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static string WoodEarlycolorPerlinEnable { get; }
Visual Basic
Public Shared ReadOnly Property WoodEarlycolorPerlinEnable As String
	Get
Visual C++
public:
static property String^ WoodEarlycolorPerlinEnable {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace